LaloAlvarez-e/MSP430F169/GPIO_ClockSelection/GPIO/Peripheral/RegisterDefines/Header/GPIO_RegisterDefines_OUT.h
/**
 *
 * @file GPIO_RegisterDefines_OUT.h
 * @copyright
 * @verbatim InDeviceMex 2021 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 6 feb. 2022 @endverbatim
 *
 * @author
 * @verbatim InDeviceMex @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 6 feb. 2022     InDeviceMex    1.0         initial Version@endverbatim
 */

#ifndef GPIO_PERIPHERAL_REGISTERDEFINES_HEADER_GPIO_REGISTERDEFINES_OUT_H_
#define GPIO_PERIPHERAL_REGISTERDEFINES_HEADER_GPIO_REGISTERDEFINES_OUT_H_

#include "MCU/Header/MCU_Common.h"

/******************************************************************************************
 ************************************ 2 OUT *********************************************
 ******************************************************************************************/
/*-----------*/
#define PORT_OUT_R_PIN_ALL_BIT ((uint8_t) 0U)

#define PORT_OUT_PIN_ALL_MASK ((uint8_t) 0xFFU)
#define PORT_OUT_PIN_ALL_LOW ((uint8_t) 0x00U)
#define PORT_OUT_PIN_ALL_HIGH ((uint8_t) 0xFFU)

#define PORT_OUT_R_PIN_ALL_MASK (PORT_OUT_PIN_ALL_MASK << PORT_OUT_R_PIN0_BIT)
#define PORT_OUT_R_PIN_ALL_LOW (PORT_OUT_PIN_ALL_LOW << PORT_OUT_R_PIN0_BIT)
#define PORT_OUT_R_PIN_ALL_HIGH (PORT_OUT_PIN_ALL_HIGH << PORT_OUT_R_PIN0_BIT)
/*-----------*/

/*-----------*/
#define PORT_OUT_R_PIN0_BIT ((uint8_t) 0U)

#define PORT_OUT_PIN0_MASK ((uint8_t) 0x01U)
#define PORT_OUT_PIN0_LOW ((uint8_t) 0x00U)
#define PORT_OUT_PIN0_HIGH ((uint8_t) 0x01U)

#define PORT_OUT_R_PIN0_MASK (PORT_OUT_PIN0_MASK << PORT_OUT_R_PIN0_BIT)
#define PORT_OUT_R_PIN0_LOW (PORT_OUT_PIN0_LOW << PORT_OUT_R_PIN0_BIT)
#define PORT_OUT_R_PIN0_HIGH (PORT_OUT_PIN0_HIGH << PORT_OUT_R_PIN0_BIT)
/*-----------*/

/*-----------*/
#define PORT_OUT_R_PIN1_BIT ((uint8_t) 1U)

#define PORT_OUT_PIN1_MASK ((uint8_t) 0x01U)
#define PORT_OUT_PIN1_LOW ((uint8_t) 0x00U)
#define PORT_OUT_PIN1_HIGH ((uint8_t) 0x01U)

#define PORT_OUT_R_PIN1_MASK (PORT_OUT_PIN1_MASK << PORT_OUT_R_PIN1_BIT)
#define PORT_OUT_R_PIN1_LOW (PORT_OUT_PIN1_LOW << PORT_OUT_R_PIN1_BIT)
#define PORT_OUT_R_PIN1_HIGH (PORT_OUT_PIN1_HIGH << PORT_OUT_R_PIN1_BIT)
/*-----------*/

/*-----------*/
#define PORT_OUT_R_PIN2_BIT ((uint8_t) 2U)

#define PORT_OUT_PIN2_MASK ((uint8_t) 0x01U)
#define PORT_OUT_PIN2_LOW ((uint8_t) 0x00U)
#define PORT_OUT_PIN2_HIGH ((uint8_t) 0x01U)

#define PORT_OUT_R_PIN2_MASK (PORT_OUT_PIN2_MASK << PORT_OUT_R_PIN2_BIT)
#define PORT_OUT_R_PIN2_LOW (PORT_OUT_PIN2_LOW << PORT_OUT_R_PIN2_BIT)
#define PORT_OUT_R_PIN2_HIGH (PORT_OUT_PIN2_HIGH << PORT_OUT_R_PIN2_BIT)
/*-----------*/

/*-----------*/
#define PORT_OUT_R_PIN3_BIT ((uint8_t) 3U)

#define PORT_OUT_PIN3_MASK ((uint8_t) 0x01U)
#define PORT_OUT_PIN3_LOW ((uint8_t) 0x00U)
#define PORT_OUT_PIN3_HIGH ((uint8_t) 0x01U)

#define PORT_OUT_R_PIN3_MASK (PORT_OUT_PIN3_MASK << PORT_OUT_R_PIN3_BIT)
#define PORT_OUT_R_PIN3_LOW (PORT_OUT_PIN3_LOW << PORT_OUT_R_PIN3_BIT)
#define PORT_OUT_R_PIN3_HIGH (PORT_OUT_PIN3_HIGH << PORT_OUT_R_PIN3_BIT)
/*-----------*/

/*-----------*/
#define PORT_OUT_R_PIN4_BIT ((uint8_t) 4U)

#define PORT_OUT_PIN4_MASK ((uint8_t) 0x01U)
#define PORT_OUT_PIN4_LOW ((uint8_t) 0x00U)
#define PORT_OUT_PIN4_HIGH ((uint8_t) 0x01U)

#define PORT_OUT_R_PIN4_MASK (PORT_OUT_PIN4_MASK << PORT_OUT_R_PIN4_BIT)
#define PORT_OUT_R_PIN4_LOW (PORT_OUT_PIN4_LOW << PORT_OUT_R_PIN4_BIT)
#define PORT_OUT_R_PIN4_HIGH (PORT_OUT_PIN4_HIGH << PORT_OUT_R_PIN4_BIT)
/*-----------*/

/*-----------*/
#define PORT_OUT_R_PIN5_BIT ((uint8_t) 5U)

#define PORT_OUT_PIN5_MASK ((uint8_t) 0x01U)
#define PORT_OUT_PIN5_LOW ((uint8_t) 0x00U)
#define PORT_OUT_PIN5_HIGH ((uint8_t) 0x01U)

#define PORT_OUT_R_PIN5_MASK (PORT_OUT_PIN5_MASK << PORT_OUT_R_PIN5_BIT)
#define PORT_OUT_R_PIN5_LOW (PORT_OUT_PIN5_LOW << PORT_OUT_R_PIN5_BIT)
#define PORT_OUT_R_PIN5_HIGH (PORT_OUT_PIN5_HIGH << PORT_OUT_R_PIN5_BIT)
/*-----------*/

/*-----------*/
#define PORT_OUT_R_PIN6_BIT ((uint8_t) 6U)

#define PORT_OUT_PIN6_MASK ((uint8_t) 0x01U)
#define PORT_OUT_PIN6_LOW ((uint8_t) 0x00U)
#define PORT_OUT_PIN6_HIGH ((uint8_t) 0x01U)

#define PORT_OUT_R_PIN6_MASK (PORT_OUT_PIN6_MASK << PORT_OUT_R_PIN6_BIT)
#define PORT_OUT_R_PIN6_LOW (PORT_OUT_PIN6_LOW << PORT_OUT_R_PIN6_BIT)
#define PORT_OUT_R_PIN6_HIGH (PORT_OUT_PIN6_HIGH << PORT_OUT_R_PIN6_BIT)
/*-----------*/

/*-----------*/
#define PORT_OUT_R_PIN7_BIT ((uint8_t) 7U)

#define PORT_OUT_PIN7_MASK ((uint8_t) 0x01U)
#define PORT_OUT_PIN7_LOW ((uint8_t) 0x00U)
#define PORT_OUT_PIN7_HIGH ((uint8_t) 0x01U)

#define PORT_OUT_R_PIN7_MASK (PORT_OUT_PIN7_MASK << PORT_OUT_R_PIN7_BIT)
#define PORT_OUT_R_PIN7_LOW (PORT_OUT_PIN7_LOW << PORT_OUT_R_PIN7_BIT)
#define PORT_OUT_R_PIN7_HIGH (PORT_OUT_PIN7_HIGH << PORT_OUT_R_PIN7_BIT)
/*-----------*/

#endif /* GPIO_PERIPHERAL_REGISTERDEFINES_HEADER_GPIO_REGISTERDEFINES_OUT_H_ */
